app/controllers/admins_controller.rb

  def seat
    flash[:warning] = "Seat who?" and return unless params[:pez_id]
    @pez = Pez.find params[:pez_id]
    return unless request.post?

    @image = Image.new(params[:image_form])
    @image.save!
---
INSERT INTO "images" ("size", "content_type", "pez_id", "filename", "height", "width") VALUES(112009, 'image/jpeg', NULL, 'Photo_1.jpg', NULL, NULL)

  def adminify
    return unless request.post?
    @why_not = ""
    who = params[:who]

    if no_admin_exists_yet
      Pez.first(:conditions => ['identity = ?', who]).adminify!
      flash[:message] = "You adminified the first admin: #{who}."
    elsif you_are_admin
      User.first(:conditions => ['identity = ?', who]).adminify!
---
SELECT "users".id FROM "users" WHERE ("users"."identity" = 'steva' AND "users".id <> 1) LIMIT 1