app/controllers/things_controller.rb

  def index
    @things = Thing.all :conditions => ['previous is ?', nil]
---
SELECT * FROM "things" WHERE (previous_id is NULL) ORDER BY created_at DESC

  def create
    @thing = Thing.new params[:thing]
    @thing.save!
---
INSERT INTO "things" ("created_at", "title", "body", "url", "user_id", "previous_id") VALUES('2010-09-12 23:39:50', 'one', 'one', '', 1000099, NULL)

  def show
    @thing = Thing.find params[:id]
---
SELECT * FROM "things" WHERE ("things"."id" = 1)