app/controllers/users_controller.rb

INSERT INTO "votes" ("pez_id", "user_id", "approve") VALUES(1000021, 1000099, 't')
---
  def vote
    @pez = Pez.find params[:pez_id]
    @approve = params[:approve] || false
    Vote.create :user => session[:user], :pez => @pez, :approve => @approve