app/controllers/users_controller.rb

  def signup
    @user = User.new(params[:user])
    if request.post?
      if @user.save
---
INSERT INTO "users" ("name", "salt", "identity", "created_at", "admin", "hashed_password", "email") VALUES(NULL, '8m8Jq3met8', 'steve', '2010-08-30 23:32:14', 'f', 'bbfc5dcf2e143966c1ad8d78bb290dd97cfa45e2', 'steven@deobald.ca')

  def forgot_password
    if request.post?
      u= User.find_by_email(params[:user][:email])
---
SELECT "users".id FROM "users" WHERE ("users"."email" = 'exbob@mcbob.com' AND "users".id <> 1000002) LIMIT 1

  def change_password
    @user=session[:user]
    if request.post?
      @user.update_attributes(:password=>params[:user][:password], :password_confirmation => params[:user][:password_confirmation])
---
UPDATE "users" SET "hashed_password" = 'b10928d123e0eed5e6fbf97ceaed44dc9b577524' WHERE "id" = 1000010